ct = new Array(); ct[0] = new myCity('台北市', '1', new Array('中正區', '100', '100', '大同區', '103', '103', '中山區', '104', '104', '松山區', '105', '105', '大安區', '106', '106', '萬華區', '108', '108', '信義區', '110', '110', '士林區', '111', '111', '北投區', '112', '112', '內湖區', '114', '114', '南港區', '115', '115', '文山區', '116', '116')); ct[1] = new myCity('基隆市', '2', new Array('仁愛區', '200', '200', '信義區', '201', '201', '中正區', '202', '202', '中山區', '203', '203', '安樂區', '204', '204', '暖暖區', '205', '205', '七堵區', '206', '206')); ct[2] = new myCity('新北市', '3', new Array('萬里區', '207', '207', '金山區', '208', '208', '板橋區', '220', '220', '汐止區', '221', '221', '深坑區', '222', '222', '石碇區', '223', '223', '瑞芳區', '224', '224', '平溪區', '226', '226', '雙溪區', '227', '227', '貢寮區', '228', '228', '新店區', '231', '231', '坪林區', '232', '232', '烏來區', '233', '233', '永和區', '234', '234', '中和區', '235', '235', '土城區', '236', '236', '三峽區', '237', '237', '樹林區', '238', '238', '鶯歌區', '239', '239', '三重區', '241', '241', '新莊區', '242', '242', '泰山區', '243', '243', '林口區', '244', '244', '蘆洲區', '247', '247', '五股區', '248', '248', '八里區', '249', '249', '淡水區', '251', '251', '三芝區', '252', '252', '石門區', '253', '253')); ct[3] = new myCity('宜蘭縣', '4', new Array('宜蘭市', '260', '260', '頭城鎮', '261', '261', '礁溪鄉', '262', '262', '壯圍鄉', '263', '263', '員山鄉', '264', '264', '羅東鎮', '265', '265', '三星鄉', '266', '266', '大同鄉', '267', '267', '五結鄉', '268', '268', '冬山鄉', '269', '269', '蘇澳鎮', '270', '270', '南澳鄉', '272', '272')); ct[4] = new myCity('新竹市', '5', new Array('新竹市', '300', '300')); ct[5] = new myCity('新竹縣', '6', new Array('竹北市', '302', '302', '湖口鄉', '303', '303', '新豐鄉', '304', '304', '新埔鎮', '305', '305', '關西鎮', '306', '306', '芎林鄉', '307', '307', '寶山鄉', '308', '308', '竹東鎮', '310', '310', '五峰鄉', '311', '311', '橫山鄉', '312', '312', '尖石鄉', '313', '313', '北埔鄉', '314', '314', '峨眉鄉', '315', '315')); ct[6] = new myCity('桃園市', '7', new Array('中壢區', '320', '320', '平鎮區', '324', '324', '龍潭區', '325', '325', '楊梅區', '326', '326', '新屋區', '327', '327', '觀音區', '328', '328', '桃園區', '330', '330', '龜山區', '333', '333', '八德區', '334', '334', '大溪區', '335', '335', '復興區', '336', '336', '大園區', '337', '337', '蘆竹區', '338', '338')); ct[7] = new myCity('苗栗縣', '8', new Array('竹南鎮', '350', '350', '頭份鎮', '351', '351', '三灣鄉', '352', '352', '南庄鄉', '353', '353', '獅潭鄉', '354', '354', '後龍鎮', '356', '356', '通宵鎮', '357', '357', '苑裡鎮', '358', '358', '苗栗市', '360', '360', '造橋鄉', '361', '361', '頭屋鄉', '362', '362', '公館鄉', '363', '363', '大湖鄉', '364', '364', '泰安鄉', '365', '365', '銅鑼鄉', '366', '366', '三義鄉', '367', '367', '西湖鄉', '368', '368', '卓蘭鎮', '369', '369')); ct[8] = new myCity('台中市', '9', new Array('中區', '400', '400', '東區', '401', '401', '南區', '402', '402', '西區', '403', '403', '北區', '404', '404', '北屯區', '406', '406', '西屯區', '407', '407', '南屯區', '408', '408', '太平區', '411', '411', '大里區', '412', '412', '霧峰區', '413', '413', '烏日區', '414', '414', '豐原區', '420', '420', '后里區', '421', '421', '石岡區', '422', '422', '東勢區', '423', '423', '和平區', '424', '424', '新社區', '426', '426', '潭子區', '427', '427', '大雅區', '428', '428', '神岡區', '429', '429', '大肚區', '432', '432', '沙鹿區', '433', '433', '龍井區', '434', '434', '梧棲區', '435', '435', '清水區', '436', '436', '大甲區', '437', '437', '外埔區', '438', '438', '大安區', '439', '439')); ct[9] = new myCity('彰化縣', '10', new Array('彰化市', '500', '500', '芬園鄉', '502', '502', '花壇鄉', '503', '503', '秀水鄉', '504', '504', '鹿港鎮', '505', '505', '福興鄉', '506', '506', '線西鄉', '507', '507', '和美鎮', '508', '508', '伸港鄉', '509', '509', '員林鎮', '510', '510', '社頭鄉', '511', '511', '永靖鄉', '512', '512', '埔心鄉', '513', '513', '溪湖鎮', '514', '514', '大村鄉', '515', '515', '埔鹽鄉', '516', '516', '田中鎮', '520', '520', '北斗鎮', '521', '521', '田尾鄉', '522', '522', '埤頭鄉', '523', '523', '溪州鄉', '524', '524', '竹塘鄉', '525', '525', '二林鎮', '526', '526', '大城鄉', '527', '527', '芳苑鄉', '528', '528', '二水鄉', '530', '530')); ct[10] = new myCity('南投縣', '11', new Array('南投市', '540', '540', '中寮鄉', '541', '541', '草屯鎮', '542', '542', '國姓鄉', '544', '544', '埔里鎮', '545', '545', '仁愛鄉', '546', '546', '名間鄉', '551', '551', '集集鎮', '552', '552', '水里鄉', '553', '553', '魚池鄉', '555', '555', '信義鄉', '556', '556', '竹山鎮', '557', '557', '鹿谷鄉', '558', '558')); ct[11] = new myCity('嘉義市', '12', new Array('嘉義市', '600', '600')); ct[12] = new myCity('嘉義縣', '13', new Array('番路鄉', '602', '602', '梅山鄉', '603', '603', '竹崎鄉', '604', '604', '阿里山', '605', '605', '中埔鄉', '606', '606', '大埔鄉', '607', '607', '水上鄉', '608', '608', '鹿草鄉', '611', '611', '太保市', '612', '612', '朴子市', '613', '613', '東石鄉', '614', '614', '六腳鄉', '615', '615', '新港鄉', '616', '616', '民雄鄉', '621', '621', '大林鎮', '622', '622', '溪口鄉', '623', '623', '義竹鄉', '624', '624', '布袋鎮', '625', '625')); ct[13] = new myCity('雲林縣', '14', new Array('斗南鎮', '630', '630', '大埤鄉', '631', '631', '虎尾鎮', '632', '632', '土庫鎮', '633', '633', '褒忠鄉', '634', '634', '東勢鄉', '635', '635', '台西鄉', '636', '636', '崙背鄉', '637', '637', '麥寮鄉', '638', '638', '斗六市', '640', '640', '林內鄉', '643', '643', '古坑鄉', '646', '646', '莿桐鄉', '647', '647', '西螺鎮', '648', '648', '二崙鄉', '649', '649', '北港鎮', '651', '651', '水林鄉', '652', '652', '口湖鄉', '653', '653', '四湖鄉', '654', '654', '元長鄉', '655', '655')); ct[14] = new myCity('台南市', '15', new Array('中西區', '700', '700', '東區', '701', '701', '南區', '702', '702', '北區', '704', '704', '安平區', '708', '708', '安南區', '709', '709', '永康區', '710', '710', '歸仁區', '711', '711', '新化區', '712', '712', '左鎮區', '713', '713', '玉井區', '714', '714', '楠西區', '715', '715', '南化區', '716', '716', '仁德區', '717', '717', '關廟區', '718', '718', '龍崎區', '719', '719', '官田區', '720', '720', '麻豆區', '721', '721', '佳里區', '722', '722', '西港區', '723', '723', '七股區', '724', '724', '將軍區', '725', '725', '學甲區', '726', '726', '北門區', '727', '727', '新營區', '730', '730', '後壁區', '731', '731', '白河區', '732', '732', '東山區', '733', '733', '六甲區', '734', '734', '下營區', '735', '735', '柳營區', '736', '736', '鹽水區', '737', '737', '善化區', '741', '741', '大內區', '742', '742', '山上區', '743', '743', '新市區', '744', '744', '安定區', '745', '745')); ct[15] = new myCity('高雄市', '16', new Array('新興區', '800', '800', '前金區', '801', '801', '苓雅區', '802', '802', '鹽埕區', '803', '803', '鼓山區', '804', '804', '旗津區', '805', '805', '前鎮區', '806', '806', '三民區', '807', '807', '楠梓區', '811', '811', '小港區', '812', '812', '左營區', '813', '813', '仁武區', '814', '814', '大社區', '815', '815', '岡山區', '820', '820', '路竹區', '821', '821', '阿蓮區', '822', '822', '田寮區', '823', '823', '燕巢區', '824', '824', '橋頭區', '825', '825', '梓官區', '826', '826', '彌陀區', '827', '827', '永安區', '828', '828', '湖內區', '829', '829', '鳳山區', '830', '830', '大寮區', '831', '831', '林園區', '832', '832', '鳥松區', '833', '833', '大樹區', '840', '840', '旗山區', '842', '842', '美濃區', '843', '843', '六龜區', '844', '844', '內門區', '845', '845', '杉林區', '846', '846', '甲仙區', '847', '847', '桃源區', '848', '848', '三民區', '849', '849', '茂林區', '851', '851', '茄定區', '852', '852')); ct[16] = new myCity('澎湖縣', '17', new Array('馬公市', '880', '880', '西嶼鄉', '881', '881', '望安鄉', '882', '882', '七美鄉', '883', '883', '白沙鄉', '884', '884', '湖西鄉', '885', '885')); ct[17] = new myCity('屏東縣', '18', new Array('屏東市', '900', '900', '三地門鄉', '901', '901', '霧臺鄉', '902', '902', '瑪家鄉', '903', '903', '九如鄉', '904', '904', '里港鄉', '905', '905', '高樹鄉', '906', '906', '鹽埔鄉', '907', '907', '長治鄉', '908', '908', '麟洛鄉', '909', '909', '竹田鄉', '911', '911', '內埔鄉', '912', '912', '萬丹鄉', '913', '913', '潮州鎮', '920', '920', '泰武鄉', '921', '921', '來義鄉', '922', '922', '萬巒鄉', '923', '923', '崁頂鄉', '924', '924', '新埤鄉', '925', '925', '南州鄉', '926', '926', '林邊鄉', '927', '927', '東港鎮', '928', '928', '琉球鄉', '929', '929', '佳冬鄉', '931', '931', '新園鄉', '932', '932', '枋寮鄉', '940', '940', '枋山鄉', '941', '941', '春日鄉', '942', '942', '獅子鄉', '943', '943', '車城鄉', '944', '944', '牡丹鄉', '945', '945', '恆春鎮', '946', '946', '滿州鄉', '947', '947')); ct[18] = new myCity('台東縣', '19', new Array('台東市', '950', '950', '綠島鄉', '951', '951', '蘭嶼鄉', '952', '952', '延平鄉', '953', '953', '卑南鄉', '954', '954', '鹿野鄉', '955', '955', '關山鎮', '956', '956', '海瑞鄉', '957', '957', '池上鄉', '958', '958', '東河鄉', '959', '959', '成功鎮', '961', '961', '長濱鄉', '962', '962', '太麻里鄉', '963', '963', '金峰鄉', '964', '964', '大武鄉', '965', '965', '達仁鄉', '966', '966')); ct[19] = new myCity('花蓮縣', '20', new Array('花蓮市', '970', '970', '新城鄉', '971', '971', '秀林鄉', '972', '972', '吉安鄉', '973', '973', '壽豐鄉', '974', '974', '鳳林鄉', '975', '975', '光復鄉', '976', '976', '豐濱鄉', '977', '977', '瑞穗鄉', '978', '978', '萬榮鄉', '979', '979', '玉里鎮', '981', '981', '卓溪鄉', '982', '982', '富里鄉', '983', '983')); ct[20] = new myCity('金門縣', '21', new Array('金沙鎮', '890', '890', '金湖鎮', '891', '891', '金寧鄉', '892', '892', '金城鎮', '893', '893', '烈嶼鄉', '894', '894', '烏坵鄉', '896', '896')); ct[21] = new myCity('連江縣', '22', new Array('南竿鄉', '209', '209', '北竿鄉', '210', '210', '莒光鄉', '211', '211', '東引鄉', '212', '212')); ct[22] = new myCity('南海諸島', '23', new Array('東沙群島', '817', '817', '南沙群島', '819', '819')); ct[23] = new myCity('釣魚台列嶼', '24', new Array('釣魚台列嶼', '290', '290'));



function areaNode(name, zipcode, telzip) {
    this.name = name;
    this.zipcode = zipcode;
    this.telzip = telzip;
}


function myVillage(villages) {

    myareaTmp = new Array();
    for (var i = 0; i < villages.length; i += 3) {
        myareaTmp[i / 3] = new areaNode(villages[i], villages[i + 1], villages[i + 2]);
    }
    return myareaTmp;

}


function myCity(city, citycode, villages) {
    this.city = city;
    this.citycode = citycode;
    this.villages = new myVillage(villages);
}

//將縣市下拉選項列出
function printCity(obj, selitm) {
    obj.length = 1;
    for (var j = 0; j < ct.length; j++) {
        k = ct[j];
        obj.length = j + 2;
        obj[j + 1].text = k.city;
        obj[j + 1].value = k.city;

        if (k.city == selitm) {
            obj[j + 1].selected = true;
        }
    }
}

//選擇縣市後,將鄉鎮地區下拉選項列出
function selCity(cityObj, villObj, selno) {

    var idx = cityObj.selectedIndex;
    var cityName = cityObj[idx].text;
    villObj.length = 1;

    for (var j = 0; j < ct.length; j++) {
        k = ct[j];
        if (k.city == cityName) {
            printVillage(villObj, j, selno);
            if (villObj.length == 2) {
                //villObj.selectedIndex = 1;//
            }
            return;
        }
    }
}

function printVillage(villObj, cityIdx, selno) {
    villObj.length = 1;
    k = ct[cityIdx];

    for (var i = 0; i < k.villages.length; i++) {
        villObj.length = i + 2;
        villObj[i + 1].text = k.villages[i].name;
        villObj[i + 1].value = k.villages[i].zipcode;

        if (selno == villObj[i + 1].value) {
            villObj[i + 1].selected = true;
        }
    }
}



/*此function會傳回對應的電話區碼==>telObj
但電話區碼的 text 必須為一陣列*/
//ok
function selVillage(cityObj, villObj, telObj) {
    var cityName = cityObj[cityObj.selectedIndex].value;
    var villageName = villObj[villObj.selectedIndex].value;

    for (var j = 0; j < ct.length; j++) {
        k = ct[j];
        if (k.city == cityName) {

            for (var i = 0; i < k.villages.length; i++) {

                if (k.villages[i].zipcode == villageName) {
                    telObj.value = k.villages[i].telzip;
                    return;
                }
            }
        }
    }
}




function bodyLoad(xx, yy) {
    var ObjFrm = document.form2;
    printCity(ObjFrm.cty, xx);
    selCity(ObjFrm.cty, ObjFrm.ara, yy);
    //selVillage(ObjFrm.cty,ObjFrm.ara,yy);
}


